src/DataProcessors/ФормированиеПеремещенийПоЗаказамНаПроизводство/ФормированиеПеремещенийПоЗаказамНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФормированиеПеремещенийПоЗаказамНаПроизводство</name>
  <attributes>
    <name>ВариантОформления</name>
    <type>
      <types>EnumRef.ВариантыОформленияДокументовПеремещения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>План</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаПроизводство</name>
      <type>
        <types>DocumentRef.ЗаказНаПроизводство2_2</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючНоменклатура</name>
      <comment>Идентификатор номенклатуры в структуре заказа</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючПартия</name>
      <comment>Идентификатор узла структуры заказа</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>СкладПолучатель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СкладОтправитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьПеремещения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Требуется</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отметка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КПеремещению</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/Enums/СтатусыВнутреннихЗаказов/СтатусыВнутреннихЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыВнутреннихЗаказов</name>
  <enumValues>
    <name>УдалитьКОбеспечению</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ЗаказМатериаловВПроизводство/ЗаказМатериаловВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказМатериаловВПроизводство</name>
  <basedOn>Document.ИзменениеАссортимента</basedOn>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузке</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыМатериаловВПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыМатериаловСУчетомКорректировок</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКПоступлению</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеховаяКладовая</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтгружатьЧастями</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаполненияМногооборотнойТары</name>
    <type>
      <types>EnumRef.СостоянияЗаполненияМногооборотнойТары</types>
    </type>
  </attributes>
  <attributes>
    <name>УправлениеПроизводством2_2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаказовМатериаловВПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказМатериаловВПроизводство</types>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.ЗаказДавальца2_5</types>
      <types>DocumentRef.ЗаказНаРемонт</types>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ИзменениеАссортимента</types>
      <types>DocumentRef.ЗаказДавальца</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьПеремещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДлительностьПеремещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПотреблениеДляДеятельности</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбосабливатьПоНазначениюЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаПродукции</name>
      <type>
        <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеПоступления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обособленно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспеченияДоИзмененияОбновлениемИБ</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/СпособыОбеспеченияПотребностей/СпособыОбеспеченияПотребностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпособыОбеспеченияПотребностей</name>
  <comment>содержит параметры источника пополнения запаса и временные параметры обеспечения</comment>
  <attributes>
    <name>ИсточникОбеспеченияПотребностей</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСПоставщиками</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбеспечения</name>
    <type>
      <types>EnumRef.ТипыОбеспечения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦеныПоставщика</name>
    <type>
      <types>CatalogRef.ВидыЦенПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьВДнях</name>
    <comment>Срок исполнения заказа источником обеспечения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбеспечиваемыйПериод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующейПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьПлановыеЗаказы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаЗаказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГарантированныйСрокОбеспечения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПланированияПолуфабрикатов</name>
    <type>
      <types>EnumRef.СпособыПланированияПолуфабрикатов</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/ФормированиеПеремещенийПоЗаказамНаПроизводство/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область НоменклатурныйПлан

Процедура ПолучитьНоменклатурныйПланОтложенно(Параметры, АдресХранилища) Экспорт

	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Формирование перемещений: переход к номенклатурному плану");
	
	ПозицииПлана = ПозицииПланаВнутриЗамераВремени(Параметры);
	
	ПоместитьВоВременноеХранилище(ПозицииПлана, АдресХранилища);
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, ПозицииПлана.Количество());
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеДокументов

Процедура СоздатьДокументыОтложенно(Параметры, АдресХранилища) Экспорт
	
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Формирование перемещений: создание документов");
	
	РезультатВыполнения = СоздатьДокументыОтложенноВнутриЗамераВремени(Параметры);
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, РезультатВыполнения.Документы.Количество());
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Функция СтруктураДоступа() Экспорт
	
	ВариантОбособленияВПеремещении = Константы.ВариантОбособленияТоваровВПеремещении.Получить();
	
	ВариантОбособленияПриПередаче  = Константы.ВариантОбособленияМатериаловПриПередачеВПроизводство.Получить();
	
	ЗаказНаПеремещениеДоступен = ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыНаПеремещение")
		И ВариантОбособленияВПеремещении = Перечисления.ВариантыОбособленияТоваровВПеремещении.НазначениеПолучателя
		И ПравоДоступа("Добавление", Метаданные.Документы.ЗаказНаПеремещение);
		
	ЗаказМатериаловДоступен = ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПроизводством2_2")
		И ВариантОбособленияПриПередаче = Перечисления.ВариантыОбособленияМатериаловПриПередачеВПроизводство.НазначениеПолучателя
		И ПравоДоступа("Добавление", Метаданные.Документы.ЗаказМатериаловВПроизводство);
	
	ПеремещениеДоступно = ПолучитьФункциональнуюОпцию("ИспользоватьПеремещениеТоваров")
		И ПравоДоступа("Добавление", Метаданные.Документы.ПеремещениеТоваров);
		
	ПередачаМатериаловДоступна = ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПроизводством2_2")
		И ПравоДоступа("Добавление", Метаданные.Документы.ДвижениеПродукцииИМатериалов);
	
	СтруктураДоступа = Новый Структура;
	СтруктураДоступа.Вставить("ЗаказНаПеремещениеДоступен", ЗаказНаПеремещениеДоступен);
	СтруктураДоступа.Вставить("ЗаказМатериаловДоступен",    ЗаказМатериаловДоступен);
	СтруктураДоступа.Вставить("ПеремещениеДоступно",        ПеремещениеДоступно);
	СтруктураДоступа.Вставить("ПередачаМатериаловДоступна", ПередачаМатериаловДоступна);
	
	Возврат СтруктураДоступа;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НоменклатурныйПлан

Процедура НоменклатурныйПланВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц, НастройкиДляОтборов) Экспорт

	СхемаКомпоновкиДанных = Обработки.ФормированиеПеремещенийПоЗаказамНаПроизводство.ПолучитьМакет("НоменклатурныйПлан");
	
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиДляОтборов);
	
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(
		СхемаКомпоновкиДанных,
		КомпоновщикНастроек.ПолучитьНастройки()
		,
		,
		,
		,
		Ложь);
		
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(МакетКомпоновкиДанных.НаборыДанных.НаборДанных.Запрос);
	
	ЗапросВыбора = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество()-1];
	ЗапросВыбора.ТаблицаДляПомещения = "НоменклатурныйПлан";
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры") Тогда
		Поле = ЗапросВыбора.Операторы[0].ВыбираемыеПоля.Добавить(
			"ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)");
		ЗапросВыбора.Колонки.Найти(Поле).Псевдоним = "Характеристика";
	КонецЕсли;
	
	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Для каждого ПараметрКомпоновки Из МакетКомпоновкиДанных.ЗначенияПараметров Цикл
		Запрос.УстановитьПараметр(ПараметрКомпоновки.Имя, ПараметрКомпоновки.Значение);
	КонецЦикла;
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ПозицииПланаВнутриЗамераВремени(Параметры)

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	НоменклатурныйПланВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц, Параметры.Настройки);

	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"" + Справочники.ФорматыМагазинов.ТекстЗапросаВтФорматыСкладов(Ложь) +
	"ВЫБРАТЬ
	|	
	|	ПП.Номенклатура         КАК Номенклатура,
	|	ПП.Характеристика       КАК Характеристика,
	|	ПП.Назначение           КАК Назначение,
	|
	|	ПП.СкладПолучатель      КАК СкладПолучатель,
	|	ПП.СкладОтправитель     КАК СкладОтправитель,
	|
	|	ПП.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|
	|	ПП.ДатаНачала          КАК ДатаНачала,
	|	ПП.ДатаОкончания       КАК ДатаОкончания,
	|
	|	ПП.Требуется КАК Требуется,
	|
	|	ПП.Доступно > 0 КАК ЕстьОбеспечение,
	|	ПП.Доступно КАК Обеспечено,
	|	ПП.Доступно КАК КПеремещению,
	|
	|	ПП.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|
	|	ПП.ЗаказНаПроизводство.Организация             КАК Организация,
	|	ПП.ЗаказНаПроизводство.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|
	|	ISNULL(ОсновнойСпособОбеспечения.ДлительностьВДнях, 0) КАК ДлительностьПеремещения
	|
	|ИЗ
	|	НоменклатурныйПлан КАК ПП
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОбеспеченияПотребностей КАК ОсновнойСпособОбеспечения
	|		ПО &ПодстановкаОсновногоСпособаОбеспечения
	|
	|УПОРЯДОЧИТЬ ПО
	|
	|	ПП.ЗаказНаПроизводство.Приоритет.РеквизитДопУпорядочивания,
	|	ПП.ЗаказНаПроизводство.Подразделение.РеквизитДопУпорядочивания,
	|	ПП.ЗаказНаПроизводство.Очередь,
	|	ПП.ДатаНачала
	|
	|";
	
	ПоляСоединения = "ПП.Номенклатура, ПП.Характеристика, ПП.СкладПолучатель";
	ИмяПараметра   = "ПодстановкаОсновногоСпособаОбеспечения";
	
	Запрос.Текст = РегистрыСведений.СхемыОбеспечения.ПодставитьСоединениеДляПолученияСпособаОбеспечения(
		Запрос.Текст, ИмяПараметра, ПоляСоединения);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Возврат Таблица;
	
КонецФункции

#КонецОбласти

#Область СозданиеДокументов

Функция СоздатьДокументыОтложенноВнутриЗамераВремени(Параметры) Экспорт
	
	Результат = Новый Структура("Документы, Сообщения", Новый Массив(), Новый Массив());
	
	ВариантОформления = Параметры.ВариантОформления;
	ВыгруженнаяТаблица = Параметры.ВыгруженнаяТаблица; // ТаблицаЗначений
	
	ВыгруженнаяТаблица.Колонки.Добавить("НачалоОтгрузки", ОбщегоНазначенияУТ.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата));
	ВыгруженнаяТаблица.Колонки.Добавить("ОкончаниеПоступления", ОбщегоНазначенияУТ.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата));
	ВыгруженнаяТаблица.Колонки.Добавить("ВариантОбеспечения");
	ВыгруженнаяТаблица.Колонки.Добавить("Обособленно");
	ВыгруженнаяТаблица.Колонки.Добавить("Количество");
	ВыгруженнаяТаблица.Колонки.Добавить("КоличествоУпаковок");
	
	НачалоОтгрузки = НачалоДня(ТекущаяДатаСеанса());
	ДлительностьСуток = 3600 * 24;
	Для Каждого СтрокаТаблицы Из ВыгруженнаяТаблица Цикл
		
		СтрокаТаблицы.Обособленно = НЕ СтрокаТаблицы.Назначение.Пустая();
		СтрокаТаблицы.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
		СтрокаТаблицы.НачалоОтгрузки       = НачалоОтгрузки;
		СтрокаТаблицы.ОкончаниеПоступления = НачалоОтгрузки + ДлительностьСуток * СтрокаТаблицы.ДлительностьПеремещения;
		СтрокаТаблицы.Количество = СтрокаТаблицы.КПеремещению;
		СтрокаТаблицы.КоличествоУпаковок = СтрокаТаблицы.КПеремещению;
		
	КонецЦикла;
	
	ПоляКлюча = "СкладОтправитель,СкладПолучатель,НаправлениеДеятельности,Организация";
	ВыгруженнаяТаблица.Сортировать(ПоляКлюча, Новый СравнениеЗначений);
	
	РезультатРазбиения = ОбеспечениеСервер.РазбитьТаблицуПоЗначениюКлюча(ВыгруженнаяТаблица, ПоляКлюча, ПоляКлюча);
	
	СтруктураДоступа = Обработки.УправлениеПеремещениемОбособленныхТоваров.СтруктураДоступа();
	
	Кладовые = Новый Соответствие();
	//++ НЕ УТ
	Кладовые = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ВыгруженнаяТаблица.ВыгрузитьКолонку("СкладПолучатель"), "ЦеховаяКладовая");
	//-- НЕ УТ
	
	Если ВариантОформления = Перечисления.ВариантыОформленияДокументовПеремещения.ЗаказНаПеремещение Тогда
		
		Для Каждого Элемент Из РезультатРазбиения Цикл
			
			Если СтруктураДоступа.ЗаказМатериаловДоступен И Кладовые.Получить(Элемент.Ключ.СкладПолучатель) = Истина Тогда
				
				ДанныеЗаполненияДокумента = Новый Структура("Склад,ЦеховаяКладовая,НаправлениеДеятельности,Организация,Товары");
				ДанныеЗаполненияДокумента.Склад                   = Элемент.Ключ.СкладОтправитель;
				ДанныеЗаполненияДокумента.ЦеховаяКладовая         = Элемент.Ключ.СкладПолучатель;
				ДанныеЗаполненияДокумента.НаправлениеДеятельности = Элемент.Ключ.НаправлениеДеятельности;
				ДанныеЗаполненияДокумента.Организация             = Элемент.Ключ.Организация;
				ДанныеЗаполненияДокумента.Товары = Элемент.Таблица;
				
				ДокументОбъект = Обработки.ОбеспечениеПотребностей.ЗаполнитьИПровестиДокумент(
					Документы.ЗаказМатериаловВПроизводство,
					ДанныеЗаполненияДокумента,
					Перечисления.СтатусыЗаказовМатериаловВПроизводство.КВыполнению,
					Результат.Сообщения);
				
			Иначе
				
				ДанныеЗаполненияДокумента = Новый Структура("СкладОтправитель,СкладПолучатель,НаправлениеДеятельности,Организация,Товары");
				ЗаполнитьЗначенияСвойств(ДанныеЗаполненияДокумента, Элемент.Ключ);
				ДанныеЗаполненияДокумента.Товары = Элемент.Таблица;
				
				ДокументОбъект = Обработки.ОбеспечениеПотребностей.ЗаполнитьИПровестиДокумент(
					Документы.ЗаказНаПеремещение,
					ДанныеЗаполненияДокумента,
					Перечисления.СтатусыВнутреннихЗаказов.КВыполнению,
					Результат.Сообщения);
				
			КонецЕсли;
			
			Результат.Документы.Добавить(ДокументОбъект.Ссылка);
			ПоместитьВоВременноеХранилище(Результат, Параметры.АдресРезультатаФормированияЗаказов);
			
		КонецЦикла;
		
	ИначеЕсли ВариантОформления = Перечисления.ВариантыОформленияДокументовПеремещения.ПеремещениеТоваров Тогда
		
		Для Каждого Элемент Из РезультатРазбиения Цикл
			
			Если СтруктураДоступа.ПередачаМатериаловДоступна И Кладовые.Получить(Элемент.Ключ.СкладПолучатель) = Истина Тогда
				
				РеквизитыШапки = Новый Структура;
				РеквизитыШапки.Вставить("Отправитель",             Элемент.Ключ.СкладОтправитель);
				РеквизитыШапки.Вставить("Получатель",              Элемент.Ключ.СкладПолучатель);
				РеквизитыШапки.Вставить("НаправлениеДеятельности", Элемент.Ключ.НаправлениеДеятельности);
				РеквизитыШапки.Вставить("Организация",             Элемент.Ключ.Организация);
				РеквизитыШапки.Вставить("Дата",                    ТекущаяДатаСеанса());
				РеквизитыШапки.Вставить("ХозяйственнаяОперация",   Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую);
				
				ДанныеЗаполненияДокумента = Новый Структура("РеквизитыШапки, Товары", РеквизитыШапки, Элемент.Таблица);
				
				ДокументОбъект = Обработки.ОбеспечениеПотребностей.ЗаполнитьИПровестиДокумент(
					Документы.ДвижениеПродукцииИМатериалов,
					ДанныеЗаполненияДокумента,
					Перечисления.СтатусыДвиженияПродукцииИМатериалов.Отгружено,
					Результат.Сообщения);
				
			Иначе
				
				ДанныеЗаполненияДокумента = Новый Структура("СкладОтправитель,СкладПолучатель,НаправлениеДеятельности,Организация,Товары");
				ЗаполнитьЗначенияСвойств(ДанныеЗаполненияДокумента, Элемент.Ключ);
				ДанныеЗаполненияДокумента.Товары = Элемент.Таблица;
				
				ДокументОбъект = Обработки.ОбеспечениеПотребностей.ЗаполнитьИПровестиДокумент(
					Документы.ПеремещениеТоваров,
					ДанныеЗаполненияДокумента,
					Перечисления.СтатусыПеремещенийТоваров.Отгружено,
					Результат.Сообщения);
				
			КонецЕсли;
			
			Результат.Документы.Добавить(ДокументОбъект.Ссылка);
			ПоместитьВоВременноеХранилище(Результат, Параметры.АдресРезультатаФормированияЗаказов);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция СоставКолонокДляСозданияДокументов() Экспорт
	
	Возврат "
		|СкладПолучатель,
		|СкладОтправитель,
		|НаправлениеДеятельности,
		|Организация,
		|Номенклатура,
		|Характеристика,
		|Назначение,
		|ДлительностьПеремещения
		|";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
